% параметры функций принадлежности входной переменной fi
fi_1_a = -0.786;
fi_1_b = -0.786;
fi_1_c = 0;
fi_2_a = -0.786;
fi_2_b = 0;
fi_2_c = 0.786;
fi_3_a = 0;
fi_3_b = 0.786;
fi_3_c = 0.786;

% параметры функций принадлежности входной переменной omega
omega_1_a = -1.57;
omega_1_b = -1.57;
omega_1_c = 0;
omega_2_a = -1.57;
omega_2_b = 0;
omega_2_c = 1.57;
omega_3_a = 0;
omega_3_b = 1.57;
omega_3_c = 1.57;

% диапазон изменения выходной переменной force
FORCE_Range_1 = -150;
FORCE_Range_2 = 150;

% параметры функций принадлежности выходной переменной force
FORCE_1_a = -150;
FORCE_1_b = -150;
FORCE_1_c = 0;
FORCE_2_a = -150;
FORCE_2_b = 0;
FORCE_2_c = 150;
FORCE_3_a = 0;
FORCE_3_b = 150;
FORCE_3_c = 150;