% параметры функций принадлежности входной переменной fi
fi_1_a = 0.1768;
fi_1_b = 3.278;
fi_1_c = -0.7664;
fi_2_a = 0.1965;
fi_2_b = 3.278;
fi_2_c = -0.393;
fi_3_a = 0.1965;
fi_3_b = 3.278;
fi_3_c = 0;
fi_4_a = 0.1965;
fi_4_b = 3.278;
fi_4_c = 0.393;
fi_5_a = 0.1768;
fi_5_b = 3.278;
fi_5_c = 0.7664;

% параметры функций принадлежности входной переменной omega
omega_1_a = 0.3532;
omega_1_b = 3.278;
omega_1_c = -1.531;
omega_2_a = 0.3925;
omega_2_b = 3.278;
omega_2_c = -0.785;
omega_3_a = 0.3925;
omega_3_b = 3.278;
omega_3_c = 0;
omega_4_a = 0.3925;
omega_4_b = 3.278;
omega_4_c = 0.785;
omega_5_a = 0.3532;
omega_5_b = 3.278;
omega_5_c = 1.531;

% диапазон изменения выходной переменной force
FORCE_Range_1 = -150;
FORCE_Range_2 = 150;

% параметры функций принадлежности выходной переменной force
force_1_a = 33.74;
force_1_b = 3.278;
force_1_c = -146.3;
force_2_a = 37.5;
force_2_b = 3.278;
force_2_c = -75;
force_3_a = 37.5;
force_3_b = 3.278;
force_3_c = 0;
force_4_a = 37.5;
force_4_b = 3.278;
force_4_c = 75;
force_5_a = 33.74;
force_5_b = 3.278;
force_5_c = 146.3;